using System;
using System.Collections.Generic;
using System.Linq;
public class Program
{
    public static void Main()
    {
// 1) Метод, который выводит на экран строку. Символы, из которых состоит строка, и их количество вводятся пользователем. 
// 2) Написать программу для поиска индекса элемента массива (тип элементов в массиве -int; ). Поиск должен вернуть индекс первого найденного элемента. 

  //////////////////////////////////////
       /* int countOfUserSymbol = 0;
        string symbolOfUser = "";
        Console.Write("Введите количество символов в строке: ");
        countOfUserSymbol = int.Parse(Console.ReadLine());
        Console.Write("Ввкдите символ из которого будет состоять строка: ");
        symbolOfUser = Console.ReadLine();
        for (int i = 1; i <= countOfUserSymbol; i++)
        {
            Console.Write ($@" {symbolOfUser} ");
        }   
        */

        /////////////////////////////////////

        
    }
}